In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
nn=np.nan
s1=Series([2,nn,4,7,nn,8,9,10,nn,8])
s1

0     2.0
1     NaN
2     4.0
3     7.0
4     NaN
5     8.0
6     9.0
7    10.0
8     NaN
9     8.0
dtype: float64

In [4]:
s1.drop_duplicates()

0     2.0
1     NaN
2     4.0
3     7.0
5     8.0
6     9.0
7    10.0
dtype: float64

In [5]:
s1

0     2.0
1     NaN
2     4.0
3     7.0
4     NaN
5     8.0
6     9.0
7    10.0
8     NaN
9     8.0
dtype: float64

In [6]:
s1.dropna()

0     2.0
2     4.0
3     7.0
5     8.0
6     9.0
7    10.0
9     8.0
dtype: float64

In [7]:
s1.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [9]:
s1.isna()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8     True
9    False
dtype: bool

In [98]:
nn=np.nan
df1=DataFrame([[2,4,nn,nn],[nn,3,nn,nn],[nn,6,7,nn],[8,9,10,nn],[nn,nn,nn,nn]],index=np.arange(5),columns=np.arange(4))
df1

     0    1     2   3
0  2.0  4.0   NaN NaN
1  NaN  3.0   NaN NaN
2  NaN  6.0   7.0 NaN
3  8.0  9.0  10.0 NaN
4  NaN  NaN   NaN NaN

In [70]:
df1.dropna()

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [71]:
dfc=df1.dropna(how='any')
dfc

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [72]:
df1

   one  two  three  four
A  2.0  4.0    NaN   NaN
B  NaN  3.0    NaN   NaN
C  NaN  6.0    7.0   NaN
D  8.0  9.0   10.0   NaN
E  NaN  NaN    NaN   NaN

In [73]:
df1.dropna(how='all')

   one  two  three  four
A  2.0  4.0    NaN   NaN
B  NaN  3.0    NaN   NaN
C  NaN  6.0    7.0   NaN
D  8.0  9.0   10.0   NaN

In [74]:
df1.dropna(thresh=2)

   one  two  three  four
A  2.0  4.0    NaN   NaN
C  NaN  6.0    7.0   NaN
D  8.0  9.0   10.0   NaN

In [75]:
df1

   one  two  three  four
A  2.0  4.0    NaN   NaN
B  NaN  3.0    NaN   NaN
C  NaN  6.0    7.0   NaN
D  8.0  9.0   10.0   NaN
E  NaN  NaN    NaN   NaN

In [76]:
df1.dropna(axis=1,thresh=2,how='all')

   one  two  three
A  2.0  4.0    NaN
B  NaN  3.0    NaN
C  NaN  6.0    7.0
D  8.0  9.0   10.0
E  NaN  NaN    NaN

In [91]:
df1

   one  two  three  four
0  2.0  4.0    NaN   NaN
1  NaN  3.0    NaN   NaN
2  NaN  6.0    7.0   NaN
3  8.0  9.0   10.0   NaN
4  NaN  NaN    NaN   NaN

In [88]:
df1.fillna(1)

   one  two  three  four
0  2.0  4.0    1.0   1.0
1  1.0  3.0    1.0   1.0
2  1.0  6.0    7.0   1.0
3  8.0  9.0   10.0   1.0
4  1.0  1.0    1.0   1.0

In [99]:
df1.fillna({0:0,1:1,2:2,3:3,4:4})

     0    1     2    3
0  2.0  4.0   2.0  3.0
1  0.0  3.0   2.0  3.0
2  0.0  6.0   7.0  3.0
3  8.0  9.0  10.0  3.0
4  0.0  1.0   2.0  3.0

In [64]:
df3.dropna(inplace=True)
df3

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [93]:
df1

   one  two  three  four
0  2.0  4.0    NaN   NaN
1  NaN  3.0    NaN   NaN
2  NaN  6.0    7.0   NaN
3  8.0  9.0   10.0   NaN
4  NaN  NaN    NaN   NaN

In [95]:
df1.dropna(axis=1,thresh=2)

   one  two  three
0  2.0  4.0    NaN
1  NaN  3.0    NaN
2  NaN  6.0    7.0
3  8.0  9.0   10.0
4  NaN  NaN    NaN